[
  {
    "id": 1,
    "title": "Clean water for children",
    "image": "https://i.ibb.co/NjRCXGj/gettyimages-1219697768-kids-drinking-water-1800.jpg",
    "bg_color": "#0052FF26",
    "button_color":"#0052FF33",
    "text_color": "#0052FF",
    "button_text": "Health",
    "description": "Access to clean and safe drinking water is a fundamental human right, especially for children. This topic highlights the critical importance of providing clean water sources to children worldwide to safeguard their health, well-being, and future prospects. Clean water not only prevents waterborne diseases but also supports children's growth, education, and overall development, making it a crucial focus of global efforts to improve child health and welfare.",
    "donation_amount": 260
  },
  {
    "id": 2,
    "title": "Good education",
    "image": "https://i.ibb.co/30n7cX8/Rectangle-4288.png",
    "bg_color": "#FF444926",
    "button_color": "#FF444933",
    "text_color": "#FF444A",
    "button_text": "Education",
    "description": "There are many things that can be done to ensure that all people have access to a good education. Governments can invest in public schools, provide financial assistance to students, and make sure that all schools have qualified teachers and resources. Families can support their children's education by creating a learning environment at home and helping them with their schoolwork. Teachers can create a positive and supportive learning environment for their students and challenge them to reach their full potential.",
    "donation_amount": 340
  },
  {
    "id": 3,
    "title": "Used Clothing Drive",
    "image": "https://i.ibb.co/GvX3p65/Bin-Landscape2-1024x576.jpg",
    "bg_color": "#79C23F26",
    "button_color": "#79C23F33",
    "text_color": "#0052FF",
    "button_text": "Clothing",
    "description": "A used clothing drive is a charitable initiative aimed at gathering gently worn clothing from the community to redistribute to those in need. These drives serve multiple purposes: assisting individuals facing financial hardship, reducing textile waste, and promoting sustainable consumption practices. By encouraging people to donate their gently used clothing items, these drives help extend the life of garments, reduce landfill waste, and provide warmth and comfort to those less fortunate. This charitable effort embodies the spirit of community support and environmental responsibility.",
    "donation_amount": 220
  },
  {
    "id": 4,
    "title": "Better Food for Everyone",
    "image": "https://i.ibb.co/2tcsD0p/stirfry.jpg",
    "bg_color": "#F8714726",
    "button_color": "#F8714733",
    "text_color": "#F87147",
    "button_text": "Food",
    "description": "The concept of 'Better Food for Everyone' revolves around the idea of improving the quality, accessibility, and sustainability of our food systems. This topic encompasses a wide range of initiatives, from promoting healthier eating habits to advocating for sustainable farming practices and reducing food waste. By ensuring that everyone has access to nutritious and ethically produced food, we can address issues like malnutrition, food insecurity, and environmental sustainability, ultimately striving for a healthier, more equitable, and sustainable future for all.",
    "donation_amount": 250
  },
  {
    "id": 5,
    "title": "Donate blood and save lives.",
    "image": "https://i.ibb.co/mSwJK9X/blood-donation-campaign-template-psd-ad-poster-minimal-style-dual-set-53876-142788.jpg",
    "bg_color": "#FF3333",
    "button_color": "#FF7933",
    "text_color": "#00F623",
    "button_text": "Blood",
    "description": "A blood donation occurs when a person voluntarily has blood drawn and used for transfusions and/or made into biopharmaceutical medications by a process called fractionation (separation of whole blood components). Donation may be of whole blood, or of specific components directly (apheresis).",
    "donation_amount": 270
  },
  {
    "id": 6,
    "title": "Education is the Foundation of Happiness",
    "image": "https://i.ibb.co/qDJCrLP/depositphotos-19024147-stock-photo-drawing-city-over-book.webp",
    "bg_color": "#5AC8FA", 
    "button_color": "#FF5733", 
    "text_color": "#0048A6", 
    "button_text": "Education",
    "description": "Education is a powerful tool that can pave the way to happiness and a brighter future. The 'Education is the Foundation of Happiness' campaign is dedicated to providing quality education to those in need. Your donation can help unlock opportunities, inspire dreams, and empower individuals to lead fulfilling lives. Join us in the pursuit of happiness through education, and make a positive impact on the world.",
    "donation_amount": 780
  }
  ,
  {
    "id": 7,
    "title": "Supporting Maternal Healthcare",
    "image": "https://i.ibb.co/4dcsG7q/FEATURE-U-S-Global-Health-Budget-Tracker-Resources-1.webp",
    "bg_color": "#FF573326", 
    "button_color": "#FF573333", 
    "text_color": "#8B0000",
    "button_text": "Health",
    "description": "Help us make a difference in maternal healthcare. The 'Supporting Maternal Healthcare' campaign is focused on ensuring safe pregnancies and childbirth for mothers and newborns. Your donation can provide access to quality prenatal care, skilled birth attendants, and essential medical supplies. By supporting maternal health, we can save lives and create healthier futures for mothers and their children.",
    "donation_amount": 250
  },
  {
    "id": 8,
    "title": "Empower Girls Through Education",
    "image": "https://i.ibb.co/dDpTKJg/girls-in-their-uniforms.jpg",
    "bg_color": "#FF66A326",
    "button_color": "#FF66A333", 
    "text_color": "#4B0082",
    "button_text": "Education",
    "description": "Support our mission to empower girls through education. The 'Empower Girls Through Education' campaign is dedicated to providing quality education to girls worldwide. Your donation can help break barriers, create opportunities, and inspire future leaders. Education is the key to gender equality, and by supporting girls' education, we can build a brighter and more inclusive future for all.",
    "donation_amount": 180
  }
  ,
  {
    "id": 9,
    "title": "Planting Trees for a Greener Tomorrow",
    "image": "https://i.ibb.co/XysmJn9/rsz-adobestock-390433831.webp",
    "bg_color": "#4CAF5026",
    "button_color": "#4CAF5033",
    "text_color": "#004d00", 
    "button_text": "Nature",
    "description": "Join our mission to combat climate change and preserve our planet's future. The 'Planting Trees for a Greener Tomorrow' campaign aims to reforest and restore critical ecosystems. Your donation can help us plant trees, restore habitats, and offset carbon emissions. Together, we can make a significant impact on our environment and create a greener, more sustainable tomorrow for generations to come.",
    "donation_amount": 150
  }
  ,
  {
    "id": 10,
    "title": "Empower Minds: Support Education",
    "image": "https://i.ibb.co/2jQgvjP/1686299152012.png",
    "bg_color": "#4B008226",
    "button_color": "#4B008233", 
    "text_color": "#191970",
    "button_text": "Education",
    "description": "The 'Empower Minds: Support Education' campaign is dedicated to ensuring that quality education is accessible to all. Your donation can help provide financial assistance to students, improve classroom resources, and support qualified teachers. Together, we can create a positive and supportive learning environment, empowering young minds to reach their full potential. Join us in the journey to make education a beacon of hope and opportunity for every child.",
    "donation_amount": 430
  },
  {
    "id": 11,
    "title": "Gift of Giving: Donate Now",
    "image": "https://i.ibb.co/b1VFW8D/266979-2119x1413-gift.jpg",
    "bg_color": "#FFD70026",
    "button_color": "#FF450033",
    "text_color": "#006400", 
    "button_text": "Gift",
    "description": "The 'Gift of Giving: Donate Now' campaign is all about making a difference through your generosity. Join us in our mission to support those in need by making a donation today. Your contribution helps provide essential resources to individuals facing challenges, making a positive impact on their lives. Together, we can create a better tomorrow. Every donation counts!",
    "donation_amount": 170
  },
  {
    "id": 12,
    "title": "Empowering Sustainable Agriculture",
    "image": "https://i.ibb.co/SJdTYF9/woman-farmer-water-780x439.jpg",
    "bg_color": "#65AEDD26",
    "button_color": "#FFB14A33",
    "text_color": "#333333",
    "button_text": "Agriculture",
    "description": "The 'Empowering Sustainable Agriculture' initiative is dedicated to revolutionizing our agricultural practices by embracing sustainability, innovation, and community involvement. We strive to create a future where farming not only feeds the world but also nurtures the environment. Through advanced techniques, education, and support for local farmers, we are sowing the seeds of change to ensure food security, reduce our ecological footprint, and empower rural communities. Join us in cultivating a more sustainable and harmonious world for generations to come.",
    "donation_amount": 690
  }
  
]
